Revit 2026 API

# DocumentGetDefaultFamilyTypeId Method

---

Gets the default family type id with the given family category id.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId GetDefaultFamilyTypeId(
	ElementId familyCategoryId
)
```
```vb
Public Function GetDefaultFamilyTypeId (
	familyCategoryId As ElementId
) As ElementId
```
```cpp
public:
ElementId^ GetDefaultFamilyTypeId(
	ElementId^ familyCategoryId
)
```
```fsharp
member GetDefaultFamilyTypeId :
        familyCategoryId : ElementId -> ElementId
```

#### Parameters

familyCategoryId ElementId
     The family category id.

#### Return Value

ElementId The default family type id.

| Exception | Condition |
| --- | --- |
| ArgumentException | familyCategoryId is not a built in category or parameter Element ID. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

Document Class

Autodesk.Revit.DB Namespace